In [1]:
import numpy as np
import pandas as pd

In [2]:
# creating dataset by 3 methods
# 1. by dictonary
# 2. by ndarray
# 3. by scalar value
# syntax : pd.Series(data, index)

In [3]:
# by dictonary
dict = {'A': 5 , 'B' : 6 , 'C' : 7}
dataset = pd.Series(dict)

In [4]:
dataset

A    5
B    6
C    7
dtype: int64

In [5]:
# if dictionary is provided to series then dictionary key is dataframe index and dictionary value is dataframe value
# if dictionary is provided to dataframe then key becomes attribute name
people = {
    'First' : ['Akhilesh', 'Roman', 'John'],
    'Last' : ["Chaudhari", 'Reigns','Cena'],
    'No' : [123,456,890]
}

In [6]:
dataset = pd.Series(people)

In [7]:
dataset

First      [Akhilesh, Roman, John]
Last     [Chaudhari, Reigns, Cena]
No                 [123, 456, 890]
dtype: object

In [8]:
dataset = pd.DataFrame(people)

In [9]:
dataset

      First       Last   No
0  Akhilesh  Chaudhari  123
1     Roman     Reigns  456
2      John       Cena  890

In [10]:
type(dataset)

pandas.core.frame.DataFrame

In [11]:
type(dataset['First'])
# Series is rows of data
# if dataset is concern then series is rows of single column

pandas.core.series.Series

In [12]:
# 2ways to print a series

In [13]:
dataset['First']

0    Akhilesh
1       Roman
2        John
Name: First, dtype: object

In [14]:
dataset.First

0    Akhilesh
1       Roman
2        John
Name: First, dtype: object

In [15]:
dataset[['First','Last']]

      First       Last
0  Akhilesh  Chaudhari
1     Roman     Reigns
2      John       Cena

In [16]:
dataset.columns

Index(['First', 'Last', 'No'], dtype='object')

In [17]:
# to get row we have loc and iloc 
# iloc allows to allow us to locate integer
# loc

dataset.iloc[0:2]
# or 
# dataset.iloc[[0,1]]

      First       Last   No
0  Akhilesh  Chaudhari  123
1     Roman     Reigns  456

In [18]:
# to print any specific column of specific row then mention that way
# dataset.iloc[[rows],column_no]
# second column is printed in that we have choosen first two rows only
# in iloc we exlude last element in slicing. only include first element
# in loc we include both first and last element while slicing
# iloc is only about index as integer and loc is name of column
dataset.iloc[[0,1],2]

0    123
1    456
Name: No, dtype: int64

In [19]:
# in our dataset index is number so we access it by that number
dataset.loc[1]

First     Roman
Last     Reigns
No          456
Name: 1, dtype: object

In [20]:
dataset.loc[[1,2]]

   First    Last   No
1  Roman  Reigns  456
2   John    Cena  890

In [21]:
# we can also print column by calling it by name
dataset.loc[[0,1],['No','First']]

    No     First
0  123  Akhilesh
1  456     Roman

In [22]:
data = pd.read_csv('card_transdata.csv')

In [23]:
data.shape

(1000000, 8)

In [24]:
data.columns

Index(['distance_from_home', 'distance_from_last_transaction',
       'ratio_to_median_purchase_price', 'repeat_retailer', 'used_chip',
       'used_pin_number', 'online_order', 'fraud'],
      dtype='object')

In [25]:
data.iloc[2:10]

,distance_from_home,distance_from_last_transaction,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
2,5.091079,0.805153,0.427715,1.0,0.0,0.0,1.0,0.0
3,2.247564,5.600044,0.362663,1.0,1.0,0.0,1.0,0.0
4,44.190936,0.566486,2.222767,1.0,1.0,0.0,1.0,0.0
5,5.586408,13.261073,0.064768,1.0,0.0,0.0,0.0,0.0
6,3.724019,0.956838,0.278465,1.0,0.0,0.0,1.0,0.0
7,4.848247,0.320735,1.273050,1.0,0.0,1.0,0.0,0.0
8,0.876632,2.503609,1.516999,0.0,0.0,0.0,0.0,0.0
9,8.839047,2.970512,2.361683,1.0,0.0,0.0,1.0,0.0

In [26]:
data.loc[[10,11,12,13,14],['distance_from_last_transaction']]

    distance_from_last_transaction
10                        0.158758
11                        0.240540
12                        0.371562
13                       56.372401
14                        0.271522

In [27]:
data.loc[12:24,['distance_from_last_transaction']]

    distance_from_last_transaction
12                        0.371562
13                       56.372401
14                        0.271522
15                        0.120920
16                        0.707003
17                        6.247458
18                       34.661351
19                        1.142014
20                        1.409245
21                        4.822091
22                        0.069201
23                        0.138203
24                       67.241081

In [28]:
data['fraud'].value_counts()

0.0    912597
1.0     87403
Name: fraud, dtype: int64

# index

In [29]:
data.set_index('distance_from_last_transaction', inplace = True) # if we write inplace = True then these changes will be permanent

In [30]:
data.index

Float64Index([0.3111400080477545, 0.1755915022816658, 0.8051525945853258,
                5.60004354707232, 0.5664862680583477,  13.26107326805812,
              0.9568379284821842, 0.3207354272228163,  2.503608926692144,
              2.9705122760243827,
              ...
              11.437332545461755, 0.1025737864627129, 0.2501075967658249,
               2.844450192169913, 0.0857117956722119, 0.1126513027947371,
              2.6839037264517254, 1.4726866870566833, 0.2420233659455144,
              0.3181101207150046],
             dtype='float64', name='distance_from_last_transaction', length=1000000)

In [41]:
data.loc[0.3111400080477545]

distance_from_home                57.877857
ratio_to_median_purchase_price     1.945940
repeat_retailer                    1.000000
used_chip                          1.000000
used_pin_number                    0.000000
online_order                       0.000000
fraud                              0.000000
Name: 0.3111400080477545, dtype: float64

In [42]:
data.reset_index(inplace = True)
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

# Filtering

In [121]:
dict = {
    'First' : ['Akhilesh','John','Roman','Steve']     ,
    'Last' :  ['Chaudhari','Cena','Reigns','Chaudhari'] ,
    'email' : ['ac@gmail.com','jc@gmail.com','rr@gmail.com','st@gmail.com']
}

In [122]:
df = pd.DataFrame(dict)

In [123]:
df

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2     Roman     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [72]:
df['Last'] == 'Chaudhari'

0     True
1    False
2    False
3     True
Name: Last, dtype: bool

In [73]:
filt = (df['Last'] == 'Chaudhari')

In [74]:
df[filt]
# another method is df[df['Last'] == 'Chaudhari']

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [75]:
df.loc[filt]

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [76]:
df.loc[filt, 'Last']

0    Chaudhari
3    Chaudhari
Name: Last, dtype: object

In [77]:
filt = (df['Last'] == 'Chaudhari') | (df['First'] == 'John')

In [78]:
df[filt]
# we can use df[~filt] for negation result

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [79]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

In [80]:
df

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2     Roman     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [81]:
name_list = ['Akhilesh','Roman']
filt = (df['First'].isin(name_list))

In [82]:
df[filt]

      First       Last         email
0  Akhilesh  Chaudhari  ac@gmail.com
2     Roman     Reigns  rr@gmail.com

# update rows and columns

In [83]:
df.columns

Index(['First', 'Last', 'email'], dtype='object')

In [84]:
# rename column names
df.columns = ['first_name','last_name','mobile']

In [85]:
df.columns

Index(['first_name', 'last_name', 'mobile'], dtype='object')

In [86]:
df

  first_name  last_name        mobile
0   Akhilesh  Chaudhari  ac@gmail.com
1       John       Cena  jc@gmail.com
2      Roman     Reigns  rr@gmail.com
3      Steve  Chaudhari  st@gmail.com

In [87]:
# make all column names in upper case letter
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME  LAST_NAME        MOBILE
0   Akhilesh  Chaudhari  ac@gmail.com
1       John       Cena  jc@gmail.com
2      Roman     Reigns  rr@gmail.com
3      Steve  Chaudhari  st@gmail.com

In [88]:
# replace _ by space in column name
df.columns = df.columns.str.replace('_',' ')
df

  FIRST NAME  LAST NAME        MOBILE
0   Akhilesh  Chaudhari  ac@gmail.com
1       John       Cena  jc@gmail.com
2      Roman     Reigns  rr@gmail.com
3      Steve  Chaudhari  st@gmail.com

In [89]:
df.columns = [x.lower() for x in df.columns]
df

  first name  last name        mobile
0   Akhilesh  Chaudhari  ac@gmail.com
1       John       Cena  jc@gmail.com
2      Roman     Reigns  rr@gmail.com
3      Steve  Chaudhari  st@gmail.com

In [90]:
df.columns = [df.columns.str.replace(' ','_')]
df

  first_name  last_name        mobile
0   Akhilesh  Chaudhari  ac@gmail.com
1       John       Cena  jc@gmail.com
2      Roman     Reigns  rr@gmail.com
3      Steve  Chaudhari  st@gmail.com

In [91]:
df.rename(columns = {'first_name' : 'fname', 'last_name' : 'lname'}, inplace = True)
df

      fname      lname        mobile
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2     Roman     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [92]:
# now replace some value in the dataset
# either .loc[row][column]
# or pass a list to .loc[row]
df.loc[2]['fname'] = 'Anderson'
df

      fname      lname        mobile
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com

In [93]:
#df.loc[2] = ['Roman','Reigns','rr@gmail.com']
#df
# another method
df.loc[5,['fname','lname']] = ['gold','berg']
df
# to change one value we can write
#df.at[2, 'fname'] = 'somethig'

      fname      lname        mobile
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com
5      gold       berg           NaN

In [95]:
# apply
df['lname'].apply(len)

lname    5
dtype: int64

In [99]:
def to_upper(lname) :
    return lname.upper()

In [102]:
df['lname'] = df['lname'].apply(to_upper)
# also write lambda function

AttributeError: 'Series' object has no attribute 'upper'

In [103]:
df

      fname      lname        mobile
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com
5      gold       berg           NaN

In [104]:
df.apply(len) # axis = columns

fname     5
lname     5
mobile    5
dtype: int64

In [105]:
# df.loc[5]['mobile'] = 'gb@gmail.com'
# df.loc[4]['mobile'] = 'gb@gmail.com'

In [106]:
df

      fname      lname        mobile
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com
5      gold       berg           NaN

In [107]:
# df.applymap(len)

In [108]:
df.applymap(str.lower)
# if dataframe have numerical data then error is there and also for NaN values

TypeError: descriptor 'lower' for 'str' objects doesn't apply to a 'float' object

In [109]:
# to replace column name to another
df.rename(columns = {'mobile' : 'email'} ,inplace = True)

In [110]:
df

      fname      lname         email
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com
5      gold       berg           NaN

In [111]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

In [112]:
data['used_chip'] = data['used_chip'].map({1.0 : 'Yes', 0.0 : 'No'}) 
# map() doesnt have inplace argument it by default set it as permanant

In [113]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,Yes,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,No,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,No,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,Yes,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,Yes,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,Yes,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,Yes,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,Yes,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,No,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,Yes,0.0,1.0,0.0

In [114]:
# data['repeat_retailer'].count_values()

In [115]:
pd.set_option('display.max_rows', None)

In [116]:
filt = data['used_chip'] == 'Yes'

In [117]:
data[filt]

KeyboardInterrupt:

In [118]:
df

      fname      lname         email
0  Akhilesh  Chaudhari  ac@gmail.com
1      John       Cena  jc@gmail.com
2  Anderson     Reigns  rr@gmail.com
3     Steve  Chaudhari  st@gmail.com
5      gold       berg           NaN

# add/remove row and column

In [125]:
# add column
df['full_name'] = df['First'] + ' ' + df['Last']

In [126]:
df

      First       Last         email           full_name
0  Akhilesh  Chaudhari  ac@gmail.com  Akhilesh Chaudhari
1      John       Cena  jc@gmail.com           John Cena
2     Roman     Reigns  rr@gmail.com        Roman Reigns
3     Steve  Chaudhari  st@gmail.com     Steve Chaudhari

In [128]:
df.columns = df.columns.str.replace('_',' ')
df

      First       Last         email           full name
0  Akhilesh  Chaudhari  ac@gmail.com  Akhilesh Chaudhari
1      John       Cena  jc@gmail.com           John Cena
2     Roman     Reigns  rr@gmail.com        Roman Reigns
3     Steve  Chaudhari  st@gmail.com     Steve Chaudhari

In [130]:
df.columns = ['fname','lname','email','full name']
df

      fname      lname         email           full name
0  Akhilesh  Chaudhari  ac@gmail.com  Akhilesh Chaudhari
1      John       Cena  jc@gmail.com           John Cena
2     Roman     Reigns  rr@gmail.com        Roman Reigns
3     Steve  Chaudhari  st@gmail.com     Steve Chaudhari

In [131]:
# remove column
df.drop(columns = ['fname','lname'], inplace = True)

In [133]:
# add column from existing data
df['full name'].str.split(' ',expand = True)

          0          1
0  Akhilesh  Chaudhari
1      John       Cena
2     Roman     Reigns
3     Steve  Chaudhari

In [136]:
df[['first','last']] = df['full name'].str.split(' ',expand = True)

In [137]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari

In [138]:
# adding a single row of data
df.append({'first' : 'Steve','last' : 'Harvy', 'email' : 'sh@gmail.com'}, ignore_index = True) # if ignore_index = True not written then erroris given

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari
4  sh@gmail.com                 NaN     Steve      Harvy

In [139]:
# add dataframe into another dataframe
dict1 = {
    'first' : ['William','agent']     ,
    'last' :  ['Stanley','jack'] ,
    'email' : ['ws@gmail.com','aj@gmail.com']
}

In [140]:
df1 = pd.DataFrame(dict1)

In [141]:
df1

     first     last         email
0  William  Stanley  ws@gmail.com
1    agent     jack  aj@gmail.com

In [143]:
df1['full name'] = df1['first'] + ' ' + df1['last']

In [144]:
df1

     first     last         email        full name
0  William  Stanley  ws@gmail.com  William Stanley
1    agent     jack  aj@gmail.com       agent jack

In [145]:
df = df.append(df1,ignore_index = True)

In [146]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari
4  ws@gmail.com     William Stanley   William    Stanley
5  aj@gmail.com          agent jack     agent       jack

In [147]:
df.drop(index = 5, inplace = True)

In [148]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari
4  ws@gmail.com     William Stanley   William    Stanley

In [149]:
# drop row with specific condition then use filter
filt = (df['first'] !=  'agent')

In [150]:
df[filt]

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari
4  ws@gmail.com     William Stanley   William    Stanley

In [151]:
# another method is 
df = df[df['first'] != 'agent']

In [152]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  Chaudhari
4  ws@gmail.com     William Stanley   William    Stanley

In [153]:
def to_upper(lower) :
    return lower.lower()

In [154]:
df['last'] = df['last'].apply(to_upper)

In [155]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  chaudhari
1  jc@gmail.com           John Cena      John       cena
2  rr@gmail.com        Roman Reigns     Roman     reigns
3  st@gmail.com     Steve Chaudhari     Steve  chaudhari
4  ws@gmail.com     William Stanley   William    stanley

In [156]:
# to make column name in upper case
df.columns = df.columns.str.upper()

In [157]:
df

          EMAIL           FULL NAME     FIRST       LAST
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  chaudhari
1  jc@gmail.com           John Cena      John       cena
2  rr@gmail.com        Roman Reigns     Roman     reigns
3  st@gmail.com     Steve Chaudhari     Steve  chaudhari
4  ws@gmail.com     William Stanley   William    stanley

In [163]:
df.columns =  [x.lower() for x in df.columns]

In [164]:
df

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  chaudhari
1  jc@gmail.com           John Cena      John       cena
2  rr@gmail.com        Roman Reigns     Roman     reigns
3  st@gmail.com     Steve Chaudhari     Steve  chaudhari
4  ws@gmail.com     William Stanley   William    stanley

In [166]:
df.drop(['first'],axis = 1)

          email           full name       last
0  ac@gmail.com  Akhilesh Chaudhari  chaudhari
1  jc@gmail.com           John Cena       cena
2  rr@gmail.com        Roman Reigns     reigns
3  st@gmail.com     Steve Chaudhari  chaudhari
4  ws@gmail.com     William Stanley    stanley

In [170]:
df[['f','l']] = df['full name'].str.split(' ',expand = True)

In [171]:
df

          email           full name     first       last         f          l
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  chaudhari  Akhilesh  Chaudhari
1  jc@gmail.com           John Cena      John       cena      John       Cena
2  rr@gmail.com        Roman Reigns     Roman     reigns     Roman     Reigns
3  st@gmail.com     Steve Chaudhari     Steve  chaudhari     Steve  Chaudhari
4  ws@gmail.com     William Stanley   William    stanley   William    Stanley

In [174]:
df.drop(['f','l'],axis = 1)

          email           full name     first       last
0  ac@gmail.com  Akhilesh Chaudhari  Akhilesh  chaudhari
1  jc@gmail.com           John Cena      John       cena
2  rr@gmail.com        Roman Reigns     Roman     reigns
3  st@gmail.com     Steve Chaudhari     Steve  chaudhari
4  ws@gmail.com     William Stanley   William    stanley

In [ ]:
dataset.shape

In [ ]:
# by ndarray
# syntax : pd.Series(data, index)
from random import randint as rdn
dataset = pd.Series(np.random.randn(3), index = ['a','b','c'])
dataset

In [ ]:
# if data is less then NaN is display at index name otherwise only index is printed
dictonary = {"b": 1, "a": 0, "c": 2}
dataset = pd.Series(dictonary, index = ['a','b','c','d'])
dataset

In [ ]:
# by a scalar value
dataset = pd.Series(5.0, index = ['a','b','c','d'])
dataset

# Load csv file

In [ ]:
dataset = pd.read_csv('card_transdata.csv')

In [ ]:
dataset

In [ ]:
dataset.head(10)

In [ ]:
dataset.info()

In [ ]:
dataset_schema = pd.read_csv('card_transdata.csv')

In [ ]:
dataset_schema

# Some basic operations

In [ ]:
# to give name to series
dataset1 = pd.Series(dataset,name = 'Demo')
dataset1

In [ ]:
# to check name of series
dataset1.name

In [ ]:
dataset1.size